app/Controllers/Admin/Medidas.php

SELECT *
FROM `medidas`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `medidas`
---
    public function index()
    {
        $data = [
            'titulo' => 'Listando as medidas de produtos',
            'medidas' => $this->medidaModel->withDeleted(true)->paginate(10),

SELECT *
FROM `medidas`
WHERE `id` = 7
GROUP BY `medidas`.`id`
ORDER BY `medidas`.`id` ASC
 LIMIT 1
---
    private function buscaMedidaOu404(int $id=null){
        if(!$id || !$medida = $this->medidaModel->withDeleted(true)->where('id',$id)->first()){