app/Controllers/Admin/Produtos.php

    public function cadastrar (){

        if($this->request->getPost()){

            $produto = new Produto($this->request->getPost());


            if($this->produtoModel->save($produto)){

                return redirect()->to(site_url("admin/produtos/show/".$this->produtoModel->getInsertID()))
                    ->with('sucesso',"produto $produto->nome cadastrado com Sucesso.");
            }else{

                return redirect()->back()
                    ->with('errors_model', $this->produtoModel->errors())
                    ->with('atencao','Por favor verifique os erros abaixo')
                    ->withInput();
---
SELECT `produtos`.*, `categorias`.`nome` AS `categoria`
FROM `produtos`
JOIN `categorias` ON `categorias`.`id` = `produtos`.`categoria_id`
GROUP BY `produtos`.`id`
ORDER BY `produtos`.`id` ASC
 LIMIT 1