app/Controllers/Admin/Usuarios.php

SELECT *
FROM `usuarios`
 LIMIT 2, 2
---
    public function index()
    {

        $data =[
            'titulo' => 'Listando os usuarios',
            'usuarios' => $this->usuarioModel->findAll()