app/Controllers/Admin/Usuarios.php

    public function index()
    {

        $data =[
            'titulo' => 'Listando os usuarios',
            'usuarios' => $this->usuarioModel->withDeleted(true)->paginate(10),
---
SELECT COUNT(*) AS `numrows`
FROM `usuarios`