app/Models/ProdutoExtraModel.php

SELECT `extras`.`nome` AS `extra`, `extras`.`preco`, `produtos_extras`.*
FROM `produtos_extras`
JOIN `extras` ON `extras`.`id` = `produtos_extras`.`extra_id`
JOIN `produtos` ON `produtos`.`id` = `produtos_extras`.`produto_id`
WHERE `produtos_extras`.`produto_id` = 2
---
    public function buscaExtrasDoProduto(int $produto_id=null){
        return $this->select('extras.nome AS extra,produtos_extras.*')
                    ->join('extras','extras.id = produtos_extras.extra_id')
                    ->join('produtos','produtos.id = produtos_extras.produto_id')
                    ->where('produtos_extras.produto_id',$produto_id)
                    ->findAll();