app/Models/ProdutoModel.php

    public function buscaProdutosWebHome(){
        return $this->select([
            'produtos.id',
            'produtos.nome',
            'produtos.ingredientes',
            'produtos.slug',
            'produtos.imagem',
            'categorias.id AS categoria_id',
            'categorias.nome AS categoria',
            'categorias.slug As categoria_slug',
        ])
        ->selectMin('produtos_especificacoes.preco')
        ->join('categorias','categorias.id = produtos.categoria_id')
        ->join('produtos_especificacoes','produtos_especificacoes.produto_id = produtos.id')
        ->where('produtos.ativo',true)
        ->groupBy('produtos.nome')
        ->orderBy('categorias.nome','ASC')
        ->findAll();
---
SELECT `produtos`.`id`, `produtos`.`nome`, `produtos`.`ingredientes`, `produtos`.`slug`, `produtos`.`imagem`, `categorias`.`id` AS `categoria_id`, `categorias`.`nome` AS `categoria`, `categorias`.`slug` As `categoria_slug`, MIN(`produtos_especificacoes`.`preco`) AS `preco`
FROM `produtos`
JOIN `categorias` ON `categorias`.`id` = `produtos`.`categoria_id`
JOIN `produtos_especificacoes` ON `produtos_especificacoes`.`produto_id` = `produtos`.`id`
WHERE `produtos`.`ativo` = 1
AND `produtos`.`deletado_em` IS NULL
GROUP BY `produtos`.`nome`
ORDER BY `categorias`.`nome` ASC

    public function exibeProdutosParaCustomizarSegundaMetade(int $produto_id,int $categoria_id){
        return $this->select(['produtos.id','produtos.nome'])
                    ->join('produtos_especificacoes','produtos_especificacoes.produto_id = produtos.id')
                    ->join('categorias','categorias.id = produtos.categoria_id')
                    ->where('produtos.categoria_id',$categoria_id)
                    ->where('produtos.id !=',$produto_id)
                    ->where('produtos.ativo',true)
                    ->where('produtos_especificacoes.customizavel',true)
                    ->groupBy('produtos.nome')
                    ->findAll();
---
SELECT `produtos`.`id`, `produtos`.`nome`
FROM `produtos`
JOIN `produtos_especificacoes` ON `produtos_especificacoes`.`produto_id` = `produtos`.`id`
JOIN `categorias` ON `categorias`.`id` = `produtos`.`categoria_id`
WHERE `produtos`.`categoria_id` = 1
AND `produtos`.`id` != 3
AND `produtos`.`ativo` = 1
AND `produtos_especificacoes`.`customizavel` = 1
AND `produtos`.`deletado_em` IS NULL
GROUP BY `produtos`.`nome`